SET NAMES 'utf8';
DROP DATABASE IF EXISTS kaifanla_new;
CREATE DATABASE kaifanla_new CHARSET=UTF8;
USE kaifanla_new;
CREATE TABLE kf_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    material VARCHAR(2048)
);
INSERT INTO kf_dish(did,img_sm,img_lg,name,price,material,detail) VALUES
(   null,
    '1小.png',
    '1大.png',
    '【避风塘茶味虾】',
    36,
    '明虾、番茄酱、白糖、白醋、葱、姜、淀粉',
    '1.虾清洗干净，挑去虾线减去虾须，葱姜剁成末备用2.少许开水冲一撮绿茶，待茶叶完全泡开并凉透时，将茶叶水倒在鲜虾上，并加入2小勺盐、几滴白酒、葱姜末腌制半小时，茶叶沥干备用3.用清水漂洗虾，沥干水分后，在虾凉面沾一层薄淀粉，锅里放一大勺油，油热后将虾放进去，煎熟一面翻另一面，直到虾颜色鲜红即可夹出4.蒜剥皮剁成末，炒锅里放少许油，放蒜末入锅煸香，小火不停地翻炒，直到蒜粒变成金黄，加入面包糠一起翻炒，加少许胡椒粉、盐和鸡粉，将沥干的茶叶放进去一起翻炒，最后将煎好的虾放进去，让虾沾上'
),
(   null,
    '2小.png',
    '2大.png',
    '【海鲜意面】',
    16.5,
    '材料：直条型意面，鲜虾，青口贝，圣女果，橄榄油，黄油，盐，味精，现磨黑胡椒，番茄酱。',
    '步骤：1.水加盐烧开，将面条成辐射状放入锅中，并且不停的搅动至面煮好。 2.将煮好的面条用少许橄榄油拌匀，备用。 3.将虾、青口洗净汆熟，小番茄对切，虾去头剥壳，备用。 4.取黄油放热锅中融化，将 虾、青口 小番茄翻炒几下， 放入面条、盐、鸡精，黑胡椒继续翻炒；再放入番茄酱拌匀即可起锅，摆盘。 tips:在煮熟的意面里加橄榄油是为了防止面条粘贴在一起。
'
),
(   null,
    '3小.png',
    '3大.png',
    '【小米椒爆炒小公鸡】',
    32,
    '三黄鸡、杭椒、干红椒、新鲜小米椒、麻椒、八角、香叶、葱、姜、生抽',
    '算起来有一个星期没有更新了，忙着赶紧完成手头的工作，和孩子一起开启度假模式。我总是毫不避讳地称自己为吃货，对于我来说，度假中缺少美食是万万不可的。想要找一个风景与美食兼顾的度假地点可不太容易，工作之余忙着查路线，查攻略，总算是定好了目的地。其实我这个嗜辣族最想去的还是成都重庆一带，考虑到季节的原因，还是留到冬天再前往吧。今天上一道火辣辣的小米椒爆炒小公鸡，虽在家中，也是十足的过了把食辣的瘾，不擅吃辣的伙伴们做这道菜的时候可要记得减少辣椒的用量哦。'
),
(   null,
    '7小.png',
    '7大.png',
    '【DIY土豆新吃法】',
    16.5,
    '面粉、黄瓜、香肠、热水、土豆、盐、醋、生抽、油。',
    '洗净蒸熟，挖空后塞点喜欢的蔬菜培根奶酪条什么的，打入一个鸡蛋，再放入烤箱烤熟。好诱人啊，你想尝试一下吗？'
),
(   null,
    '8小.png',
    '8大.png',
    '【香菇油饭】',
    32,
    '美味一绝',
    '1.干香菇泡软，切成小丁；虾皮洗净2.长粒米洗净加入1倍的水放入电饭锅煮熟，再焖20分钟；煮饭的时候准备调味料3.调作料：料酒、生抽、老抽、糖、盐放入小碗中，加入80ml清水混合4.锅内倒油烧热，加入香菇丁和虾皮翻炒，再倒入调味汁，中小火煮3分钟，剩少许汤汁时关火5.将煮好的米饭放入锅中搅拌均匀即可'
),
(   null,
    '4小.png',
    '4大.png',
    '【T骨牛排】',
    80,
    '牛排可煎可烤，但想要内部嫩滑，并且肉香扑鼻，最有效的办法就是将制作温度分为两段。',
    '以煎为例，牛排第一次下锅煎炸一定要大火高温，散发出煎炸的香味，在牛肉变焦之前翻一面，将另一面也煎成深褐色。这一阶段是为了制作出牛排的风味。第二阶段就是让内部成熟，而尽量让之前变硬外部的温度不要过高，导致肉的表里温差相差过大。'
),
(   null,
    '5小.png',
    '5大.png',
    '【干煸辣子鸡】',
    48.5,
    '材料：肉鸡半只，杭椒，小米椒，花椒一把，丁香1个，干红辣椒，蒜葱姜，料酒，老抽，糖',
    '1、鸡剁块，辣椒剪好，葱姜蒜切好。锅热下油，直接倒干辣椒和花椒丁香爆香。继续加葱姜和一半的蒜爆香，一定要炒出香气。 2、加入鸡肉翻炒至肉发紧发白，倒料酒继续炒。将鸡肉的腥气炒出来。加老抽翻炒。加盐，糖，盖上锅盖中火焖5分钟。 3、开盖儿继续翻炒，加另一半大蒜继续翻炒。加入新鲜辣椒稍微翻炒两下出锅。'
),
(   null,
    '6小.png',
    '6大.png',
    '【街头小吃】',
    12,
    '用料：重庆火锅底料（麻辣烫底料）30g、干辣椒、花椒、八角、姜蒜、牛肉丸、鱼丸、鱼豆腐、豆腐泡、火腿肠、香菇、金针菇、生菜、生抽15ml、料酒15ml、白糖',
    '1.蒜拍破，姜切片；竹签洗净，将牛肉丸、鱼丸、鱼豆腐、豆腐泡、火腿肠、香菇分别用竹签串好2.锅倒油，放入花椒、干辣椒、八角用小火炒出香味，放蒜姜炒香；放火锅底料煸炒1分钟出红油后，倒清水，放料酒、生抽、白糖和盐，搅匀后盖上盖子转小火煮10分钟；3.将串好的丸子、豆腐泡等食材放入锅内煮熟，最后放入金针菇和生菜煮熟'
);
##SELECT * FROM kf_dish;
/*用户表*/
CREATE TABLE kf_users(
    userid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    uname VARCHAR(20),                     /*用户名*/
    pwd VARCHAR(20),                       /*密码*/
    phone VARCHAR(20)                      /*电话*/
);
INSERT INTO kf_users VALUES
(NULL,'mary','11111','13111112345'),
(NULL,'jerry','22222','13819196547'),
(NULL,'john','33333','13819196547');
/*订单表*/
CREATE TABLE kf_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,     /*订单ID*/
    userid INT,                             /*用户*/
    phone VARCHAR(16),                      /*联系电话*/
    user_name VARCHAR(16),                  /*收货方用户名*/
    order_time LONG,                        /*下单时间*/
    addr VARCHAR(256),                      /*订单地址*/
    totalprice FLOAT(6,2)                   /*订单总价*/
);
INSERT INTO kf_order VALUES
(NULL,1,'13501234567','大旭',1445154859209,'大钟寺中鼎B座',20.5),
(NULL,1,'13501257543','琳妹妹',1445154997543,'大钟寺中鼎B座',12.5),
(NULL,2,'13207654321','东东',1445254997612,'大钟寺中鼎B座',55),
(NULL,2,'13899999999','文兄',1445354959209,'大钟寺中鼎B座',35),
(NULL,3,'13683675299','梅姐',1445355889209,'大钟寺中鼎B座',45);
/**购物车表**/
CREATE TABLE kf_cart(
    ctid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    userid INT,                          /*用户编号：假定有用户id为 1 和 3 的两个用户有数据*/
    did INT,                             /*产品编号*/
    dishCount INT                      /*数量*/
);
INSERT INTO kf_cart VALUES (1,1,1,1),
(2,1,2,4),
(3,1,5,2),
(4,3,2,10),
(5,3,6,1);
##SELECT * FROM kf_order;
/**订单详情表**/
CREATE TABLE kf_orderdetails(
    oid INT ,                            /*订单编号*/
    did INT,                             /*产品id*/
    dishCount INT,                     /*购买数量*/
    price FLOAT(8,2)                     /*产品单价：需要记载，因为产品价格可能波动*/
);
INSERT INTO kf_orderdetails VALUES (1,1,2,5),
(1,2,1,10.5),
(2,3,1,12.5),
(3,1,3,5),
(3,2,4,10),
(4,4,7,5),
(5,5,5,4),
(5,6,2,12.5);
